TongleiJin/tempchart/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.3 Project Minimal Configuration
#
# Board: ESP32-S3 with 8MB Flash + 8MB Octal PSRAM
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_HTTPD_MAX_REQ_HDR_LEN=512
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_TYPE_ESPPSRAM64=y
CONFIG_FATFS_LFN_HEAP=y

# Console via USB Serial/JTAG (Type-C on board)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# FreeRTOS stats for `tasks` console command
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS=y

# NimBLE (from bleprph example)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n

# Wi-Fi / BLE coexistence
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_COEX_ENABLED=y

# TLS / OTA: keep internal RAM for DMA; mbedTLS buffers in PSRAM
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=98304
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
# HW AES needs DMA-capable internal RAM; software AES avoids OTA alloc failures
# CONFIG_MBEDTLS_HARDWARE_AES is not set

# Fixed app version string (overrides git describe in esp_app_desc)
CONFIG_APP_PROJECT_VER_FROM_CONFIG=y
CONFIG_APP_PROJECT_VER="1.0.4"
